; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pickup
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
(define (problem transport-42)
 (:domain transport)
 (:objects 
    v1 - vehicle
    p1 p2 p3 p4 p5 p6 p7 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init
    (capacity v1 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l7)
    (at p2 l1)
    (at p3 l1)
    (at p4 l4)
    (at p5 l4)
    (at p6 l3)
    (at p7 l5)
    (at v1 l2)
    (road l4 l10)
    (road l1 l2)
    (road l2 l1)
    (road l9 l3)
    (road l1 l5)
    (road l6 l5)
    (road l3 l7)
    (road l7 l10)
    (road l10 l4)
    (road l10 l7)
    (road l5 l1)
    (road l7 l3)
    (road l3 l9)
    (road l5 l6)
    (road l8 l2)
    (road l9 l1)
    (road l1 l9)
    (road l2 l8)
    (road l1 l7)
    (road l7 l1)
    (road l6 l7)
    (road l7 l6)
    (road l5 l10)
    (road l10 l5)
    (road l5 l9)
    (road l9 l5)
    (road l1 l6)
    (road l6 l1)
    (road l2 l10)
    (road l10 l2)
    (road l4 l8)
    (road l8 l4)
    (road l7 l9)
    (road l9 l7)
    (road l2 l5)
    (road l5 l2)
    (road l3 l6)
    (road l6 l3)
    (road l2 l4)
    (road l4 l2)
    (road l1 l4)
    (road l4 l1)
    (road l2 l7)
    (road l7 l2)
    (road l4 l6)
    (road l6 l4)
    (road l2 l6)
    (road l6 l2)
    (road l5 l7)
    (road l7 l5)
    (road l2 l3)
    (road l3 l2)
    (road l7 l8)
    (road l8 l7)
    (road l2 l9)
    (road l9 l2)
    (road l1 l3)
    (road l3 l1)
    )
 (:goal  (and 
    (at p1 l2)
    (at p2 l3)
    (at p3 l2)
    (at p4 l10)
    (at p5 l7)
    (at p6 l10)
    (at p7 l10))))

; plan
1. (drive v1 l2 l7)
   deleted: (at v1 l2)
   added: (at v1 l7)
   goals met: 0 of 7
2. (pickup v1 l7 p1 c1 c2)
   deleted: (at p1 l7) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 7
3. (drive v1 l7 l2)
   deleted: (at v1 l7)
   added: (at v1 l2)
   goals met: 0 of 7
4. (drop v1 l2 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l2) (capacity v1 c2)
   goals met: 1 of 7
5. (drive v1 l2 l1)
   deleted: (at v1 l2)
   added: (at v1 l1)
   goals met: 1 of 7
6. (pickup v1 l1 p2 c1 c2)
   deleted: (at p2 l1) (capacity v1 c2)
   added: (in p2 v1) (capacity v1 c1)
   goals met: 1 of 7
7. (drive v1 l1 l3)
   deleted: (at v1 l1)
   added: (at v1 l3)
   goals met: 1 of 7
8. (drop v1 l3 p2 c1 c2)
   deleted: (in p2 v1) (capacity v1 c1)
   added: (at p2 l3) (capacity v1 c2)
   goals met: 2 of 7
9. (drive v1 l3 l1)
   deleted: (at v1 l3)
   added: (at v1 l1)
   goals met: 2 of 7
10. (pickup v1 l1 p3 c1 c2)
   deleted: (at p3 l1) (capacity v1 c2)
   added: (in p3 v1) (capacity v1 c1)
   goals met: 2 of 7
11. (drive v1 l1 l2)
   deleted: (at v1 l1)
   added: (at v1 l2)
   goals met: 2 of 7
12. (drop v1 l2 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l2) (capacity v1 c2)
   goals met: 3 of 7
13. (drive v1 l2 l4)
   deleted: (at v1 l2)
   added: (at v1 l4)
   goals met: 3 of 7
14. (pickup v1 l4 p4 c1 c2)
   deleted: (at p4 l4) (capacity v1 c2)
   added: (in p4 v1) (capacity v1 c1)
   goals met: 3 of 7
15. (drive v1 l4 l10)
   deleted: (at v1 l4)
   added: (at v1 l10)
   goals met: 3 of 7
16. (drop v1 l10 p4 c1 c2)
   deleted: (in p4 v1) (capacity v1 c1)
   added: (at p4 l10) (capacity v1 c2)
   goals met: 4 of 7
17. (drive v1 l10 l4)
   deleted: (at v1 l10)
   added: (at v1 l4)
   goals met: 4 of 7
18. (pickup v1 l4 p5 c1 c2)
   deleted: (at p5 l4) (capacity v1 c2)
   added: (in p5 v1) (capacity v1 c1)
   goals met: 4 of 7
19. (drive v1 l4 l10)
   deleted: (at v1 l4)
   added: (at v1 l10)
   goals met: 4 of 7
20. (drive v1 l10 l7)
   deleted: (at v1 l10)
   added: (at v1 l7)
   goals met: 4 of 7
21. (drop v1 l7 p5 c1 c2)
   deleted: (in p5 v1) (capacity v1 c1)
   added: (at p5 l7) (capacity v1 c2)
   goals met: 5 of 7
22. (drive v1 l7 l3)
   deleted: (at v1 l7)
   added: (at v1 l3)
   goals met: 5 of 7
23. (pickup v1 l3 p6 c1 c2)
   deleted: (at p6 l3) (capacity v1 c2)
   added: (in p6 v1) (capacity v1 c1)
   goals met: 5 of 7
24. (drive v1 l3 l7)
   deleted: (at v1 l3)
   added: (at v1 l7)
   goals met: 5 of 7
25. (drive v1 l7 l10)
   deleted: (at v1 l7)
   added: (at v1 l10)
   goals met: 5 of 7
26. (drop v1 l10 p6 c1 c2)
   deleted: (in p6 v1) (capacity v1 c1)
   added: (at p6 l10) (capacity v1 c2)
   goals met: 6 of 7
27. (drive v1 l10 l5)
   deleted: (at v1 l10)
   added: (at v1 l5)
   goals met: 6 of 7
28. (pickup v1 l5 p7 c1 c2)
   deleted: (at p7 l5) (capacity v1 c2)
   added: (in p7 v1) (capacity v1 c1)
   goals met: 6 of 7
29. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 6 of 7
30. (drop v1 l10 p7 c1 c2)
   deleted: (in p7 v1) (capacity v1 c1)
   added: (at p7 l10) (capacity v1 c2)
   goals met: 7 of 7
